---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadBalustersPerTread
source: html/4ec5a675-dcbc-8c20-54a4-496ab716a2fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadBalustersPerTread Property

Number of Balusters per Tread must be an integer greater than zero.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadBalustersPerTread { get; }
```